<html>
	<head>
		<title></title>
	</head>
	<body>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			<strong>FACULDADE INTEGRADA DA GRANDE FORTALEZA &ndash; FGF </strong></p>
		<p align="CENTER">
			<strong>CURSO DE LETRAS </strong></p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p align="CENTER">
			<strong>DESIGNER DA INTERFACE DO USU&Aacute;RIO: UMA AN&Aacute;LISE BIBLIOM&Eacute;TRICA DA EVOLU&Ccedil;&Atilde;O T&Eacute;CNOLOGICA.</strong></p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p align="CENTER">
			<strong>CLEILSON DE SOUSA PEREIRA</strong></p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p align="CENTER">
			<strong>FORTALEZA </strong></p>
		<p align="CENTER">
			<strong>2016</strong></p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			<strong>CLEILSON DE SOUSA PEREIRA</strong></p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			<strong>DESIGNER DA INTERFACE DO USU&Aacute;RIO: UMA AN&Aacute;LISE BIBLIOM&Eacute;TRICA DA EVOLU&Ccedil;&Atilde;O T&Eacute;CNOL&Oacute;GICA</strong></p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="JUSTIFY" style="margin-left:6.5cm;">
			Artigo apresentado como requisito parcial para a obten&ccedil;&atilde;o do t&iacute;tulo do grau de Licenciado no Programa de Letras e Suas Literaturas, do Curso de Letras da Faculdade Integrada da Grande Fortaleza-FGF, sob a orienta&ccedil;&atilde;o do Prof&ordm; Me. Adriana Regina Dantas Martins.</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			<strong>FORTALEZA</strong></p>
		<p align="CENTER">
			<strong>2016</strong></p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			<strong>CLEILSON DE SOUSA PEREIRA</strong></p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			<strong>DESIGNER DA INTERFACE DO USU&Aacute;RIO: UMA AN&Aacute;LISE BIBLIOM&Eacute;TRICA DA EVOLU&Ccedil;&Atilde;O T&Eacute;CNOL&Oacute;GICA</strong></p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="JUSTIFY">
			Este artigo foi julgado adequado como requisito parcial &agrave; obten&ccedil;&atilde;o do t&iacute;tulo de Licenciado em Letras e aprovado em sua forma final pelo curso de Letras da Faculdade Integrada da Grande Fortaleza &ndash; FGF.</p>
		<p>
			Fortaleza, ____, ______________, _________</p>
		<p>
			&nbsp;</p>
		<p>
			BANCA EXAMINADORA</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			_____________________________________________</p>
		<p>
			Professora Mestre Adriana R. D. Martins (Orientadora)</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			_____________________________________________</p>
		<p>
			Professora (Examinador)</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			_____________________________________________</p>
		<p align="JUSTIFY">
			Professor (Examinador)</p>
		<p align="JUSTIFY">
			&nbsp;</p>
		<p align="JUSTIFY">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			&nbsp;</p>
		<p align="CENTER">
			<strong>RESUMO</strong></p>
		<p align="JUSTIFY">
			INTRODU&Ccedil;&Atilde;O: Numa das &aacute;reas de atua&ccedil;&atilde;o de Sistemas de Computa&ccedil;&atilde;o, o processamento de imagens e intera&ccedil;&atilde;o Homem-Computador, a interface do usu&aacute;rio ao longo dos anos vem sofrendo enormes transforma&ccedil;&otilde;es desde a populariza&ccedil;&atilde;o dos computadores pessoais, passando pelas interfaces de linhas de comandos (CLI), &agrave;s interfaces gr&aacute;ficas do usu&aacute;rio (GNU). Novas tecnologias de intera&ccedil;&atilde;o com os usu&aacute;rios que fogem da plataforma 2D para utilizarem gestos, virtualiza&ccedil;&atilde;o e manipula&ccedil;&atilde;o em ambiente 3D, trazem para realidade a fic&ccedil;&atilde;o cientifica da interface do usu&aacute;rio imersiva, interface natural de usu&aacute;rio (NUI), e os demais meios de intera&ccedil;&atilde;o homem-maquina futur&iacute;sticos projetados e desenvolvidos. OBJETIVO: O objetivo desse trabalho &eacute; tra&ccedil;ar uma linha evolutiva tecnol&oacute;gica e apontar os meios de atua&ccedil;&atilde;o direta de cada tecnologia aproveitada em seu nicho de mercado. METODOLOGIA: A abordagem metodol&oacute;gica utilizada &eacute; a pesquisa bibliom&eacute;trica e analise de peri&oacute;dicos cient&iacute;ficos. As bases de dados pesquisadas foram scholar.google.com, news.mit.edu/search, capes, spell,ieeexplore.ieee.org/search, academia.edu, proceedings.espiedigitallibrary.org, para averigua&ccedil;&atilde;o de dados do per&iacute;odo de 2000 a 2016. RESULTADOS E DISCUSS&Atilde;O: Foram obtidos em torno de mais de 2.000 resultados da &aacute;rea de estudo referente a interface do usu&aacute;rio e suas novas tecnologias, com um crescente de artigos cient&iacute;ficos e novas aplica&ccedil;&otilde;es nos &uacute;ltimos 10 anos. CONCLUS&Atilde;O: Por fim a analise forneceu um diagn&oacute;stico evolutivo, e informa&ccedil;&otilde;es que poder&atilde;o ser usadas no aprimoramento futuro de novos designers das interfaces do usu&aacute;rio. REFER&Ecirc;NCIA BIBLIOM&Eacute;TRICAS: Natural User Interfaces. Alexandr Goncharov. Student ID: 235350024. University of Southampton,2012. Brave NUI world: Designing Natural User Interfaces for Touch and Gesture by Daniel Wigdor and Dennis Wixon, November 1, 2010. The Sixth Sense Technology by Garima Srivastava, Shikha Sigh, Sep, 2015.</p>
		<p>
			<strong>Palavras-Chave: (Interface Natural do Usu&aacute;rio, Interface do Usu&aacute;rio, Desginer)</strong></p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p align="CENTER">
			<strong>ABSTRACT</strong></p>
		<p>
			&nbsp;</p>
		<p align="JUSTIFY">
			INTRODUCTION: In the areas of Computer Systems of performance, image processing and human-computer interaction, the user interface over the years has undergone enormous changes since the popularization of personal computers, through the command line interface (CLI ), the graphical user interfaces (GNU). New interaction technologies with users fleeing 2D platform to use gestures, virtualization and manipulating 3D environment, bring to reality the science fiction of the immersive user interface, natural user interface (NUI), and the other man interaction means futuristic-machine designed and developed. The aim of this work is to draw a technological evolutionary line and point out the means of direct action of each technology utilized in its market niche. METHODOLOGY: The methodological approach is the bibliometric research and analysis of scientific journals. The databases were searched scholar.google.com, news.mit.edu/search, capes, spell, ieeexplore.ieee.org / search, academia.edu, proceedings.espiedigitallibrary.org for 2000 period data inquiry to 2016. RESULTS AND DISCUSSION: we got around over 2000 results of the study area regarding the user interface and its new technologies, with a growing number of scientific articles and new applications in the last 10 years. CONCLUSION: Finally the analysis provided an evolutionary diagnostic and information that may be used in the future improvement of new designers of user interfaces. REFERENCE bibliometric: natural user interface. Alexandr Goncharov. Student ID: 235350024. University of Southampton, 2012. Brave NUI World: Designing natural user interface for Touch and Gesture by Daniel Wigdor and Dennis Wixon, November 1, 2010. The Sixth Sense Technology by Garima Srivastava, Shikha Sigh, Sep, 2015.)</p>
		<p>
			<strong>Keywords: (</strong><strong>Natural User Interface, User Interface,Designer)</strong></p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p align="CENTER">
			SUM&Aacute;RIO</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<h1>
			1. INTRODU&Ccedil;&Atilde;O</h1>
		<p>
			&nbsp;</p>
		<p align="JUSTIFY">
			Durante os &uacute;ltimos anos, presenciamos enormes transforma&ccedil;&otilde;es na intera&ccedil;&atilde;o Homem-Computador, a interface do usu&aacute;rio vem sofrendo inova&ccedil;&otilde;es desde a populariza&ccedil;&atilde;o dos computadores pessoais, o desenvolvimento de novas tecnologias, trazem novos conceitos de aplicabilidade.</p>
		<p align="JUSTIFY">
			O presente artigo tem o prop&oacute;sito de levantar dados de pesquisa e desenvolvimentos numa linha evolutiva tecnol&oacute;gica e apontar os meios de atua&ccedil;&atilde;o de cada tecnologia em seu nicho de mercado. &Eacute; importante abordar essa quest&atilde;o, para compreendermos o interesse de pesquisa e desenvolvimento da &aacute;rea de Sistema de Computa&ccedil;&atilde;o o processamento de novos meios da interface do usu&aacute;rio (IU).</p>
		<p align="JUSTIFY">
			A metodologia abordada foi a pesquisa bibliom&eacute;trica quantitativa e qualitativa. Esse estudo tem como fundamentos te&oacute;ricos as contribui&ccedil;&otilde;es de Alexandr Goncharov (2012), Pranav Mistry (2009), John Underkoffler (2010), Uebler (2001), Wigdor, Wixon (2010), Srivastiva, Singh (2015).</p>
		<p align="JUSTIFY">
			O trabalho apresenta inicialmente pesquisas em peri&oacute;dicos cient&iacute;ficos, para o levantamento de dados quantitativos, em seguida, abordamos em gr&aacute;ficos os daods pesquisados no per&iacute;odo de 2000 a 2016, apontando o crescimento das pesquisas durante esses per&iacute;odos.</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<h1>
			2. REFER&Ecirc;NCIAL TE&Oacute;RICO</h1>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<h1>
			3. METODOLOGIA</h1>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<h1>
			4. AN&Aacute;LISE E DISCUSS&Atilde;O DOS DADOS</h1>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			<strong>CONCLUS&Atilde;O</strong></p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<p>
			&nbsp;</p>
		<h1>
			REFER&Ecirc;NCIAS</h1>
		<p>
			&nbsp;</p>
		<p>
			Conforme ABNT</p>
		<p>
			&nbsp;</p>
		<p>
			<br />
			&nbsp;</p>
		<p>
			Type in Text here and Click on <strong>Source button </strong>to get HTML Source Code.&nbsp;</p>
	</body>
</html>
